{"uuid":[{"value":"3d213282-ae40-4c22-acfa-03957551ab09"}],"vid":[{"value":2302}],"langcode":[{"value":"en"}],"type":[{"target_id":"software"}],"status":[{"value":true}],"title":[{"value":"Columbus Image Data Storage and Analysis System"}],"created":[{"value":1382601873}],"promote":[{"value":true}],"sticky":[{"value":false}],"default_langcode":[{"value":true}],"path":[],"synonyms":[],"body":[{"value":"Columbus is a combination of an image database (based on Omero, OME) and an image analysis engine based on Acapella (PerkinElmer). It is dedicated to cell culture based high content screening data and is used via a web interface.\r\nIt provides a set importers for automated microscopes such as Yokogawa CellVoyager, PerkinElmer Operetta, PerkinElmer Opera and data in Metamorph format. \r\n\r\nAfter login, Images can be explored in a standard web browser by clicking on a well plate view. Image analysis workflows can be developed by combining modules like \"find nuclei\", \"find cytoplasm\", \"find spots\" for object detection. Objects can have a hierarchical structure, e.g. spot objects can be part of a cell object. The approach of workflow design  is similar to the freeware cell profiler, but more restricted (less functions and less parameters to tweak) and easier to use. \r\n\r\nMutliple intensity- and shape based features can be calculated from detected objects (e.g. texture: haralick, Garbor, SER). Objects can be classified by these features by using hard thresholds or by supervised machine learning.\r\n\r\n\r\nAnalysis workflows and results are stored in the database and can be exprted as csv tables for secondary analysis. Simple secondary analysis workflows can be also applied in Columbus directly. Results can be visualized as heatmaps on the plate view. \r\nThe HCS statistics software Genedata Screener Assay Analyzer can be directly connected to the database. \r\n\r\n\r\n\r\n","format":"basic_html","summary":""}],"field_attribution_instructions":[],"field_free_tagging":[],"field_has_author":[{"value":"PerkinElmer"}],"field_has_biological_terms":[],"field_has_comparison":[],"field_has_documentation":[],"field_has_doi":[],"field_has_entry_curator":[{"target_id":"80"}],"field_has_function":[],"field_has_interaction_level":[{"target_id":"3574"}],"field_has_license":[{"value":"commercial"}],"field_has_location":[{"uri":"http://www.perkinelmer.de/pages/020/cellularimaging/products/columbus.xhtml","title":"","options":[]}],"field_has_programming_language":[],"field_has_reference_publication":[],"field_has_topic":[],"field_has_usage_example":[],"field_image":[],"field_is_compatible_with":[],"field_is_covered_by_training_mat":[],"field_is_dependent_of":[],"field_license_openness":[{"target_id":"3577"}],"field_platform":[],"field_supported_image_dimension":[],"field_type":[{"target_id":"3567"}]}