{"uuid":[{"value":"e92eb37c-a5f9-4769-ac96-b7757d0fc91c"}],"vid":[{"value":2109}],"langcode":[{"value":"en"}],"type":[{"target_id":"software"}],"status":[{"value":true}],"title":[{"value":"VIGRA"}],"created":[{"value":1381503089}],"promote":[{"value":true}],"sticky":[{"value":false}],"default_langcode":[{"value":true}],"path":[],"synonyms":[],"body":[{"value":"VIGRA is a free C++ and Python library that provides fundamental image processing and analysis algorithms. Its generic architecture allows it to be used in many different application contexts and ecosystems. It is designed as an intelligent library (using the C++ template mechanism) which allows users to write code at a fairly high level of abstraction and optimizes away the abstraction overhead upon compilation. It can therefore work efficiently on very large data and forms the basis of ilastik and CellCognition.\r\n\r\nStrengths: open source, high quality algorithms, unlimited array dimension, arbitrary pixel types and number of channels, high speed, well tested, very flexible, easy-to-use Python bindings, support for many common file formats (including HDF5)\r\n\r\nLimitations: no GUI, C++ not suitable for everyone, BioFormats not supported, parallelization requires external control\r\n\r\nImages and Multi-dimensional Arrays:\r\n\r\n    \r\n        templated image data structures for arbitrary pixel types,\r\n        fixed-size vectors\r\n    \r\n    \r\n        multi-dimensional arrays for arbitrary high dimensions\r\n    \r\n    \r\n        pre-instantiated images with many different scalar and vector valued pixel types\r\n        (byte, short, int, float, double, complex, RGB, RGBA etc.)\r\n    \r\n    \r\n        2-dimensional image iterators, multi-dimensional iterators for arbitrary high dimensions, adapters for various image and array subsets\r\n    \r\n    \r\n        input/output of many image file formats: Windows BMP, GIF, JPEG, PNG, PNM, Sun Raster, \r\n        TIFF (including 32bit integer, float, and double pixel types and multi-page TIFF), \r\n        Khoros VIFF, HDR (high dynamic range), Andor SIF, OpenEXR\r\n    \r\n    \r\n        input/output of images with transparency (alpha channel) into suitable file formats.\r\n    \r\n    \r\n        comprehensive support for HDF5 (input/output of arrays in arbitrary dimensions)\r\n    \r\n    \r\n        continuous reconstruction of discrete images using splines: Just create\r\n        a SplineImageView of the desired order and access interpolated values and \r\n        derivative at any real-valued coordinate.\r\n    \r\n\r\nImage Processing:\r\n\r\n    \r\n        STL-style image processing algorithms with functors (e.g. arithmetic and algebraic\r\n        operations, gamma correction, contrast adaptation, thresholding), arbitrary regions \r\n        of interest using mask images\r\n    \r\n    \r\n        image resizing using resampling, linear interpolation, spline interpolation etc.\r\n    \r\n    \r\n        geometric transformations: rotation, mirroring, arbitrary affine transformations\r\n    \r\n    \r\n        automated functor creation using expression templates\r\n    \r\n    \r\n        color space conversions: RGB, sRGB, R'G'B', XYZ, L*a*b*, L*u*v*, Y'PbPr, Y'CbCr, Y'IQ, and Y'UV\r\n    \r\n    \r\n        real and complex Fourier transforms in arbitrary dimensions, \r\n        cosine and sine transform (via fftw)\r\n    \r\n    \r\n        noise normalization according to F&ouml;rstner\r\n    \r\n    \r\n        computation of the camera magnitude transfer function (MTF) via the\r\n        slanted edge technique (ISO standard 12233)\r\n    \r\n\r\nFilters:\r\n\r\n    \r\n        2-dimensional and separable convolution, Gaussian filters and their derivatives, \r\n        Laplacian of Gaussian, sharpening etc.\r\n    \r\n    \r\n        separable convolution and FFT-based convolution for arbitrary dimensional data\r\n    \r\n    \r\n        resampling convolution (input and output image have different size)\r\n    \r\n    \r\n        recursive filters (1st and 2nd order), exponential filters\r\n    \r\n    \r\n        non-linear diffusion (adaptive filters), hourglass filter\r\n    \r\n    \r\n        total-variation filtering and denoising (standard, higer-order, and adaptive methods)\r\n    \r\n    \r\n        tensor image processing: structure tensor, boundary tensor, gradient energy tensor,\r\n        linear and non-linear tensor smoothing, eigenvalue calculation etc. (2D and 3D)\r\n    \r\n    \r\n        distance transform (Manhattan, Euclidean, Checker Board norms, 2D and 3D)\r\n    \r\n    \r\n        morphological filters and median  (2D and 3D)\r\n    \r\n    \r\n        Loy/Zelinsky symmetry transform \r\n    \r\n    \r\n        Gabor filters\r\n    \r\n\r\nSegmentation:\r\n\r\n    \r\n        edge detectors: Canny, zero crossings, Shen-Castan, boundary tensor\r\n    \r\n    \r\n        corner detectors: corner response function, Beaudet, Rohr and F&ouml;rstner corner detectors\r\n        tensor based corner and junction operators\r\n    \r\n    \r\n        region growing: seeded region growing, watershed algorithm\r\n    \r\n\r\nImage Analysis:\r\n\r\n    \r\n        connected components labeling (2D and 3D)\r\n    \r\n    \r\n        detection of local minima/maxima (including plateaus, 2D and 3D)\r\n    \r\n    \r\n        tensor-basesd image analysis (2D and 3D)\r\n    \r\n    \r\n        powerful incremental computation of region and object statistics\r\n    \r\n\r\n3-dimensional Image Processing and Analysis:\r\n\r\n    \r\n        point-wise transformations, projections and expansions in arbitrary high dimensions \r\n    \r\n    \r\n        all functors (e.g. regions statistics) readily apply to higher dimensional data as well \r\n    \r\n    \r\n        separable convolution and FFT-based convolution filters, resizing, morphology, and Euclidean distance transform for arbitrary dimensional arrays (not just 3D)\r\n    \r\n    \r\n        connected components labeling, seeded region growing, watershed algorithm for volume data\r\n    \r\n\r\nMachine Learning:\r\n\r\n    \r\n        random forest classifier with various tree building strategies\r\n    \r\n    \r\n        variable importance, feature selection (based on random forest)\r\n    \r\n    \r\n        unsupervised decomposition: PCA (principle component analysis) and \r\n        pLSA (probabilistic latent semantic analysis)\r\n    \r\n\r\nMathematical Tools:\r\n\r\n    \r\n        special functions (error function, splines of arbitrary order, integer square root, chi square distribution, elliptic integrals)\r\n    \r\n    \r\n        random number generation\r\n    \r\n    \r\n        rational and fixed point numbers\r\n    \r\n    \r\n        quaternions\r\n    \r\n    \r\n        polynomials and polynomial root finding\r\n    \r\n    \r\n        matrix classes, linear algebra, solution of linear systems, eigen system computation, singular value decomposition\r\n    \r\n    \r\n        optimization: linear least squares, ridge regression, L1-constrained least squares (LASSO, non-negative LASSO, least angle regression), quadratic programming\r\n    \r\n\r\nInter-language support:\r\n\r\n    \r\n        Python bindings in both directions (use Python arrays in C++, call VIGRA functions from Python)\r\n    \r\n    \r\n        Matlab bindings of some functions\r\n    \r\n\r\n","format":"basic_html","summary":""}],"field_attribution_instructions":[],"field_free_tagging":[],"field_has_author":[{"value":"Ullrich Koethe and many contributors"}],"field_has_biological_terms":[],"field_has_comparison":[],"field_has_documentation":[],"field_has_doi":[],"field_has_entry_curator":[{"target_id":"80"}],"field_has_function":[],"field_has_interaction_level":[{"target_id":"3574"}],"field_has_license":[{"value":"MIT"}],"field_has_location":[{"uri":"http://hci.iwr.uni-heidelberg.de/vigra/","title":"","options":[]}],"field_has_programming_language":[{"target_id":"3593"},{"target_id":"3592"}],"field_has_reference_publication":[],"field_has_topic":[],"field_has_usage_example":[],"field_image":[],"field_is_compatible_with":[],"field_is_covered_by_training_mat":[],"field_is_dependent_of":[],"field_license_openness":[{"target_id":"3570"}],"field_platform":[{"target_id":"31"},{"target_id":"32"}],"field_supported_image_dimension":[{"target_id":"3561"}],"field_type":[{"target_id":"3567"}]}